import numpy as np

a = 1.21
b= 0.371
res=np.tan(a+b)**2 - (a+1.5)**(1/3) +a * b**5 - b /np.log(a)**2
print("Результат - ", res)

X = np.array([
    [1,12,60],
[1,13,61],
    [1,14,62],
    [1, 15, 63],
    [1, 16, 64],
    [1, 17, 65],
    [1, 18, 66],
    [1, 19, 67],
    [1, 20, 68],
 [1,21,69],
    [1,22,70],
    [1,23,71]
])
Y = np.array([
    [13.5],
    [13.6],
    [13.7],
    [13.8],
    [13.9],
    [14.1],
    [14.2],
    [14.3],
    [14.4],
    [14.5],
    [14.6],
    [14.7]
])
A = np.linalg.pinv(X).dot(Y)
print("Вектор оценок А:\n ", A)
Y_predicted = A[0]+A[1]*X[:,1]+A[2]*X[:,2]
print("\nПроверка Y: ",Y_predicted)